### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [1]:
# Dependencies and Setup
import pandas as pd

# File to Load (Remember to Change These)
file_load = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(file_load)

## Player Count

* Display the total number of players

In [2]:
df = pd.DataFrame(purchase_data)
df.shape

(780, 7)

In [3]:
df.shape[0]

780

In [4]:
df1 = [df.shape[0]]
df1 = pd.DataFrame(df1,columns = ['Players'])
df1

   Players
0      780

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [5]:
uniquevalues = df["Item ID"].nunique()
uniquevalues

183

In [6]:
average = df["Price"].mean()
average
average1 = format(average, '.2f')
average1

'3.05'

In [7]:
number_of_purchase = df["Purchase ID"].count()
number_of_purchase

780

In [8]:
totalrevenue = df["Price"].sum()
totalrevenue

2379.77

In [9]:
list1 = [uniquevalues,average1,number_of_purchase,totalrevenue]
df2  = pd.DataFrame([list1])
df2.columns = ['Number of Unique Items','Average Price','Number of Purchases','Total Revenue']
df2

   Number of Unique Items Average Price  Number of Purchases  Total Revenue
0                     183          3.05                  780        2379.77

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [10]:
Number = df.groupby('Gender').size()
Number

Gender
Female                   113
Male                     652
Other / Non-Disclosed     15
dtype: int64

In [11]:
#dic = {'Gender':['Female',' Male','Other / Non - Disclosed'],
      # 'Total':['113','652','15']
      #}
df3 = pd.DataFrame(Number,columns= ['Total'])
df3

                       Total
Gender
Female                   113
Male                     652
Other / Non-Disclosed     15

In [12]:
df3.index.name = None
df3

                       Total
Female                   113
Male                     652
Other / Non-Disclosed     15

In [13]:
Total = (113,652,15)
Percentage = (Total / number_of_purchase)*100

In [14]:
df4 = df3.assign(Percentage = (Total / number_of_purchase)*100 )
df4

                       Total  Percentage
Female                   113   14.487179
Male                     652   83.589744
Other / Non-Disclosed     15    1.923077


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [15]:
female_result = purchase_data[purchase_data['Gender'] == 'Female']
female_result.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
15,15,Lisassa64,21,Female,98,"Deadline, Voice Of Subtlety",2.89
18,18,Reunasu60,22,Female,82,Nirvana,4.90
38,38,Reulae52,10,Female,116,Renewed Skeletal Katana,4.18
41,41,Assosia88,20,Female,7,"Thorn, Satchel of Dark Souls",1.33
55,55,Phaelap26,25,Female,84,Arcane Gem,3.79

In [16]:
f_average = female_result['Price'].mean()
f_average

3.203008849557519

In [17]:
f_total = female_result['Price'].sum()
f_total

361.94

In [18]:
f = female_result['Purchase ID'].count()
f

113

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [19]:
#define bins
bins = [0,9.9,13.99,18.99,23.99,28.99,38.99,99.99]
group_names = ['<10','10-14','15-19','20-24','25-29','30-39','40+']

df['Age category']= pd.cut (purchase_data['Age'],bins, labels= group_names)
df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age category
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,25-29
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,25-29
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [20]:
df4 = df.groupby("Age category")
df4.count()

              Purchase ID   SN  Age  Gender  Item ID  Item Name  Price
Age category
<10                    23   23   23      23       23         23     23
10-14                  26   26   26      26       26         26     26
15-19                 115  115  115     115      115        115    115
20-24                 321  321  321     321      321        321    321
25-29                 155  155  155     155      155        155    155
30-39                 121  121  121     121      121        121    121
40+                    19   19   19      19       19         19     19

## Purchasing Analysis (Age)

In [58]:
bins = [0,9.9,13.99,18.99,23.99,28.99,38.99,99.99]
group_names = ['<10','10-14','15-19','20-24','25-29','30-39','40+']
df['Age category']= pd.cut (purchase_data['Age'],bins, labels= group_names)
df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age category
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,25-29
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,25-29
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [59]:
df4 = df.groupby("Age category")
df4.count()

              Purchase ID   SN  Age  Gender  Item ID  Item Name  Price
Age category
<10                    23   23   23      23       23         23     23
10-14                  26   26   26      26       26         26     26
15-19                 115  115  115     115      115        115    115
20-24                 321  321  321     321      321        321    321
25-29                 155  155  155     155      155        155    155
30-39                 121  121  121     121      121        121    121
40+                    19   19   19      19       19         19     19

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

             Purchase Count Average Purchase Price Total Purchase Value
SN
Lisosia93                 5                  $3.79               $18.96
Idastidru52               4                  $3.86               $15.45
Chamjask73                3                  $4.61               $13.83
Iral74                    4                  $3.40               $13.62
Iskadarya95               3                  $4.37               $13.10

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
145,Fiery Glass Crusader,9,$4.58,$41.22
108,"Extraction, Quickblade Of Trembling Hands",9,$3.53,$31.77
82,Nirvana,9,$4.90,$44.10
19,"Pursuit, Cudgel of Necromancy",8,$1.02,$8.16

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
82,Nirvana,9,$4.90,$44.10
145,Fiery Glass Crusader,9,$4.58,$41.22
92,Final Critic,8,$4.88,$39.04
103,Singed Scalpel,8,$4.35,$34.80